import acm.program.ConsoleProgram;
//სტრინგი ბალანსირებულია თუკი მასში მხოლოდ ‘L' და ‘R’ სიმბოლოება და მთაი რაოდენობა
//ერთნაირია. დაწერეთ მეთოდი რომელსაც გადაეცემა ბალანსირებული სტრინგი და რომელიც
//აბრუნებს მაქსიმუმ რამდენ ბალანსირებულ სტრინგად დაჭრა შეიძლება ამ სტრინგის.
//გაითვალისწინეთ, რომ დაჭრის შედეგად მიღებული თითოეული სტრინგი ბალანსირებული უნდა
//იყოს. ასევე გაითვალისწინეთ, რომ დაჭრილი სტრინგების შეწებებით თავდაპირველი სტრინგი
//უნდა მიიღებოდეს.
//თქვენმა მეთოდმა უნდა დააბრუნოს ნაჭრების რაოდენობა.
//მაგალითად სტრინგი “LLLLRRRR” უფრო პატარა ბალანსირებულ ნაჭრებად ვერ დაიყოფა
//შესაბამისად თქვენმა მეთოდმა უნდა დააბრუნოს 1.
//სტრინგი “LRLLRLRRRL” შეიძლება დაიჭრას ასე “LR”-“LLRLRR”-“RL”. უფრო მეტ დაბალანსებულ
//ნაჭრებად ვერ დაიჭრება შესაბამისად მეთოდმა უნდა დააბრუნოს 3.
//ხოლო სტრინგი “LRLRRL” შეიძლება დაიჭრას ასე “LR”-“LR” -”RL”. ანუ მეთოდმა უნდა დააბრუნოს
//3
public class bonusProb15 extends ConsoleProgram{
	public void run() {
		String s = readLine();
		int count = 0;
		int ans = 0;
		for(int i = 0; i < s.length(); i++) {
			if(s.charAt(i) == 'L') {
				count--;
			}
			if(s.charAt(i) == 'R') {
				count++;
			}
			if(count == 0) {
				ans++;
			}
		}
		println(ans);
	}
}
