import acm.program.ConsoleProgram;

//ამოცანა 3. გეომეტრიული პროგრესია (20 ქულა)
//თქვენი ამოცანაა დაადგინოთ არის თუ არა მომხმარებლის მიერ შემოყვანილი რიცხვები
//გეომეტრიული პროგრესია. ამისათვის თქვენ უნდა დაწეროთ კონსოლის პროგრამა.
//ჩათვალეთ რომ მომხმარებელს მხოლოდ მთელი რიცხვები შემოჰყავს მანამ სანამ არ
//შემოიყვანს -1. როგორც კი მომხმარებელი -1 შემოიყვანს თქვენმა პროგრამამ უნდა
//დაბეჭდოს სტრინგი “Geometric progresson” თუკი შეყვანილი მიმდევრობა
//გეომეტრიული პროგრესიია და უნდა დაბეჭდოს სტრინგი “Not a geometric porgression”
//წინააღმდეგ შემთხვევაში. რის შემდეგაც პროგრამამ უნდა დაასრულოს მუშაობა
public class mid2016 extends ConsoleProgram{
	public void run() {
		while(true) {
			int n = readInt();
		}
	}
}
