import stanford.karel.Karel;

//კარელი დგას 1x1 უჯრაზე. 5x1 უჯრაზე დევს 10 ცალი ბრილიანტი, კარელმა ათივე
//ბრილიანტი უნდა გადაიტანოს 6x1 უჯრაზე.
//3. კარელი დგას 1x1 უჯრაზე, გაიყვანეთ იგი პირველი ქუჩის ბოლომდე. გაითვალისწინეთ, რომ
//სამყაროს ზომა არ იცით. თქვენი პროგრამა უნდა მუშაობდეს ნებისმიერი ზომის
//სამყაროსათვის.
//4. კარელი დგას 1x1 უჯრაზე, შეავსებინეთ მას პირველი ქუჩა ბრილიანტებით. ანუ პირველი
//ქუჩის ყველა უჯრაზე უნდა იდოს ზუსტად ერთი ბრილიანტი. ჩათვალეთ რომ საწყის
//სამყაროში ბრილიანტები არსად არ დევს.


public class Problem01 extends Karel{
	public void run(){
		for(int i = 0; i < 4; i++){
			move();}
			while (beepersPresent()){
				pickBeeper();
			}
			move();
			while (beepersInBag()){
				putBeeper();
			}
		
	}
}
