package finals;
//ამოცანა 4. ჯოკერი (35 ქულა)
//თქვენი ამოცანაა გაარკვიოთ ჯოკერში საშუალოდ რამდენ დარიგებაში ერთხელ ხვდება მოთამაშის ხელში ორი ჯოკერი.
//ჯოკერი ბანქოს თამაშია და მისი თამაშისას 36 ბანქო მონაწილეობს, რომელთაგან 2 ჯოკერია. თამაშობს 4 მოთამაშე და ბანქო ამ ოთხ მოთამაშეზე 
//რიგდება თითო-თითოდ, ისე, რომ საბოლოო ჯამში თითოეულ მოთამაშეს 9-9 ბანქო ჰყავს ხელში.
//მოახდინეთ N ცალი დარიგების სიმულაცია და დაადგინეთ საშუალოდ რამდენ დარიგებაში ერთხელ მოხვდება პირველი მოთამაშის ხელში ორი ჯოკერი.
//ამისათვის უნდა დაწეროთ simulateJoker მეთოდი რომელსაც გადაეცემა მთელი რიცხვი N და აბრუნება ნამდვილ რიცხვს.

import acm.program.ConsoleProgram;

public class jokeri2014_2 extends ConsoleProgram{
	public void run() {
		println(simulateJoker(1000));
		
	}
	
	private double simulateJoker(int n) {
		for(int i = 0; i < n; i++) {
			
		}
	}
}
